#+PROPERTY: header-args:R  :session *R* :exports results

#+BEGIN_SRC R :results value silent
require(data.table)
paths <- fread('paths.csv')
params <- fread('params.csv')
#+END_SRC

#+BEGIN_SRC R :colnames yes
d <- paths[,.(completed=sum(exists), total=.N), by=.(projectPath, pathKey, paramId)]
params[paramId==0 & projectName=="pnlpublish",]
#+END_SRC

#+RESULTS:
| projectName | projectPath                  | grantId | description | paramId | param                   | paramValue |
|-------------+------------------------------+---------+-------------+---------+-------------------------+------------|
| pnlpublish  | /home/reckbo/soft/pnlpublish | nil     |             |       0 | hash_tract_querier      | e045eab    |
| pnlpublish  | /home/reckbo/soft/pnlpublish | nil     |             |       0 | hash_trainingDataT1AHCC | d6e5990    |
| pnlpublish  | /home/reckbo/soft/pnlpublish | nil     |             |       0 | hash_BRAINSTools        | 41353e8    |
| pnlpublish  | /home/reckbo/soft/pnlpublish | nil     |             |       0 | version_FreeSurfer      | 5.3.0      |
| pnlpublish  | /home/reckbo/soft/pnlpublish | nil     |             |       0 | hash_UKFTractography    | 421a7ad    |

#+BEGIN_SRC R :results output html :exports both
require(xtable)
d[, {
cat("<h2>",projectPath, paramId, "</h2>")
pth=projectPath
pid=paramId
paramCombo = params[projectPath==pth & paramId==pid,]
print(xtable(paramCombo), type="html", include.rownames=F)
print(xtable(.SD), type="html", include.rownames=F)
}
, by=.(projectPath,paramId)]

#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<h2> /home/reckbo/soft/pnlpipe 0 </h2><!-- html table generated in R 3.2.3 by xtable 1.8-2 package -->
<!-- Sat Jun  3 12:27:50 2017 -->
<table border=1>
<tr> <th> projectName </th> <th> projectPath </th> <th> grantId </th> <th> description </th> <th> paramId </th> <th> param </th> <th> paramValue </th>  </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   0 </td> <td> fw </td> <td> b </td> </tr>
   </table>
<!-- html table generated in R 3.2.3 by xtable 1.8-2 package -->
<!-- Sat Jun  3 12:27:50 2017 -->
<table border=1>
<tr> <th> pathKey </th> <th> completed </th> <th> total </th>  </tr>
  <tr> <td> fw </td> <td align="right">   0 </td> <td align="right">   2 </td> </tr>
   </table>
<h2> /home/reckbo/soft/pnlpipe 1 </h2><!-- html table generated in R 3.2.3 by xtable 1.8-2 package -->
<!-- Sat Jun  3 12:27:50 2017 -->
<table border=1>
<tr> <th> projectName </th> <th> projectPath </th> <th> grantId </th> <th> description </th> <th> paramId </th> <th> param </th> <th> paramValue </th>  </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> dwimaskPathKey </td> <td>  </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> hash_tract_querier </td> <td> e045eab </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> dwiPathKey </td> <td> dwi </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> t1maskPathKey </td> <td>  </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> hash_trainingDataT1AHCC </td> <td> d6e5990 </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> hash_BRAINSTools </td> <td> 41353e8 </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> version_FreeSurfer </td> <td> 5.3.0 </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> hash_UKFTractography </td> <td> 421a7ad </td> </tr>
  <tr> <td> pnlpipe-development </td> <td> /home/reckbo/soft/pnlpipe </td> <td align="right"> 133789 </td> <td> blah blah blah </td> <td align="right">   1 </td> <td> t1PathKey </td> <td> t1 </td> </tr>
   </table>
<!-- html table generated in R 3.2.3 by xtable 1.8-2 package -->
<!-- Sat Jun  3 12:27:50 2017 -->
<table border=1>
<tr> <th> pathKey </th> <th> completed </th> <th> total </th>  </tr>
  <tr> <td> fs </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> dwied </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> dwimask </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> t1 </td> <td align="right">   1 </td> <td align="right">   1 </td> </tr>
  <tr> <td> fsindwi </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> wmql </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> tractmeasures </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> t1mask </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> dwixc </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> ukf </td> <td align="right">   0 </td> <td align="right">   1 </td> </tr>
  <tr> <td> t1xc </td> <td align="right">   1 </td> <td align="right">   1 </td> </tr>
  <tr> <td> dwi </td> <td align="right">   1 </td> <td align="right">   1 </td> </tr>
   </table>
<h2> /home/reckbo/soft/pnlpublish 0 </h2><!-- html table generated in R 3.2.3 by xtable 1.8-2 package -->
<!-- Sat Jun  3 12:27:50 2017 -->
<table border=1>
<tr> <th> projectName </th> <th> projectPath </th> <th> grantId </th> <th> description </th> <th> paramId </th> <th> param </th> <th> paramValue </th>  </tr>
  <tr> <td> pnlpublish </td> <td> /home/reckbo/soft/pnlpublish </td> <td align="right">  </td> <td>  </td> <td align="right">   0 </td> <td> hash_tract_querier </td> <td> e045eab </td> </tr>
  <tr> <td> pnlpublish </td> <td> /home/reckbo/soft/pnlpublish </td> <td align="right">  </td> <td>  </td> <td align="right">   0 </td> <td> hash_trainingDataT1AHCC </td> <td> d6e5990 </td> </tr>
  <tr> <td> pnlpublish </td> <td> /home/reckbo/soft/pnlpublish </td> <td align="right">  </td> <td>  </td> <td align="right">   0 </td> <td> hash_BRAINSTools </td> <td> 41353e8 </td> </tr>
  <tr> <td> pnlpublish </td> <td> /home/reckbo/soft/pnlpublish </td> <td align="right">  </td> <td>  </td> <td align="right">   0 </td> <td> version_FreeSurfer </td> <td> 5.3.0 </td> </tr>
  <tr> <td> pnlpublish </td> <td> /home/reckbo/soft/pnlpublish </td> <td align="right">  </td> <td>  </td> <td align="right">   0 </td> <td> hash_UKFTractography </td> <td> 421a7ad </td> </tr>
   </table>
<!-- html table generated in R 3.2.3 by xtable 1.8-2 package -->
<!-- Sat Jun  3 12:27:50 2017 -->
<table border=1>
<tr> <th> pathKey </th> <th> completed </th> <th> total </th>  </tr>
  <tr> <td> dwi </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> dwied </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> t1mask </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> fs_brain </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> dwimask </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> fs_wmparc </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> t1 </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> wmql </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> tractmeasures </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> dwixc </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> ukf </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> t1xc </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
  <tr> <td> fsindwi </td> <td align="right">   0 </td> <td align="right">   3 </td> </tr>
   </table>
Empty data.table (0 rows) of 2 cols: projectPath,paramId
#+END_EXPORT
